app/controllers/articles/publish_controller.rb

  def update
    @article = Article.find(params[:id])
    if @article.update(published: true, published_on: Time.now)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "articles" SET "published" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["published", "t"], ["updated_at", "2017-06-13 02:08:17.288222"], ["id", 2]]