app/controllers/admin_controller.rb

SELECT "articles".* FROM "articles" ORDER BY Created_at DESC
---
  def index
  	@articles = Article.all(:order => "Created_at DESC")