app/controllers/articles_controller.rb

  def index
    @articles = Article.published.page(params[:page]).per(5).ordered
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."published" = 't'

  def create
  	@article = current_user.articles.build(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "published", "summary", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", "786"]]
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = 786  [["body", "Brand new article content. It's much better than the old content"], ["updated_at", Mon, 02 Nov 2015 20:34:28 UTC +00:00]]