app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "MyString"], ["created_at", "2017-06-13 02:18:00.885086"], ["updated_at", "2017-06-13 02:18:00.885086"]]
---
  def create
    @contact = Contact.new(contact_params)

    if @contact.save