app/controllers/tutorials_controller.rb

SELECT "tutorials".* FROM "tutorials"
---
  def index
    @tutorials = Tutorial.all