app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "remember_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1980"]]
UPDATE "users" SET "username" = $1, "email" = $2, "password_digest" = $3, "remember_token" = $4, "updated_at" = $5 WHERE "users"."id" = 1981